chipKIT32/chipKIT-core/pic32/boards.txt
# new items
chipkit_WiFire_80MHz.platform=pic32
chipkit_WiFire_80MHz.build.board=_BOARD_WIFIRE_80MHZ_
chipkit_WiFire_80MHz.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

chipkit_WiFire_80MHz.upload.protocol=stk500v2
chipkit_WiFire_80MHz.upload.maximum_size=520192
chipkit_WiFire_80MHz.upload.maximum_data_size=524288
chipkit_WiFire_80MHz.upload.speed=115200
chipkit_WiFire_80MHz.upload.tool=pic32prog

chipkit_WiFire_80MHz.build.mcu=32MZ2048ECG100
chipkit_WiFire_80MHz.build.f_cpu=80000000UL
chipkit_WiFire_80MHz.build.core=pic32
chipkit_WiFire_80MHz.ldcommon=chipKIT-application-COMMON-MZ.ld
chipkit_WiFire_80MHz.build.variant=WiFire
chipkit_WiFire_80MHz.build.ldscript.path={build.variant.path}

############################################################
############################################################
OpenScope.name=OpenScope
OpenScope.group=chipKIT

# new items
OpenScope.platform=pic32
OpenScope.build.board=_BOARD_OPENSCOPE_
OpenScope.ldscript=OpenScope.ld
# end of new items

OpenScope.upload.protocol=stk500v2
OpenScope.upload.maximum_size=2031616
OpenScope.upload.maximum_data_size=524288
OpenScope.upload.speed=115200

OpenScope.build.mcu=32MZ2048EFG124
OpenScope.build.f_cpu=200000000UL
OpenScope.build.core=pic32
OpenScope.ldcommon=chipKIT-application-COMMON-MZ.ld
OpenScope.build.variant=OpenScope
OpenScope.build.ldscript.path={build.variant.path}
#OpenScope.upload.using=avrdude1
OpenScope.upload.tool=pic32prog
#OpenScope.upload.tool=avrdude

############################################################
openbci.name=OpenBCI 32
openbci.group=chipKIT

# new items
openbci.platform=pic32
openbci.build.board=_BOARD_DP32_
openbci.build.extra_flags=-D_USE_USB_FOR_SERIAL_

openbci.ccflags=-Map="map.map"
openbci.ldscript=chipKIT-application-32MX250F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
openbci.compiler.c.extra_flags=-G1024
openbci.compiler.cpp.extra_flags=-G1024
# end of new items

openbci.upload.protocol=stk500v2
# 128KB - 4K for EEPROM - 4K for bootloader
openbci.upload.maximum_size=122880
openbci.upload.maximum_data_size=32768
openbci.upload.speed=115200
openbci.upload.tool=pic32prog

openbci.build.mcu=32MX250F128B
openbci.build.f_cpu=40000000L
openbci.build.core=pic32
openbci.build.variant=openbci

############################################################

lenny.name=chipKIT Lenny
lenny.group=chipKIT
lenny.platform=pic32
lenny.build.board=_BOARD_LENNY_
lenny.build.extra_flags=-D_USE_USB_FOR_SERIAL_
lenny.ccflags=-Map="map.map"
lenny.ldscript=chipKIT-application-32MX270F256.ld

# Use this -G1024 option ONLY for boards with 64K RAM or less
lenny.compiler.c.extra_flags=-G1024
lenny.compiler.cpp.extra_flags=-G1024
lenny.upload.protocol=stk500v2

# 128KB - 4K for EEPROM - 4K for bootloader
lenny.upload.maximum_size=122880
lenny.upload.speed=115200
lenny.upload.tool=pic32prog

lenny.build.mcu=32MX270F256D
lenny.build.f_cpu=40000000L
lenny.build.core=pic32
lenny.build.variant=Lenny

############################################################
clicker2.name=MikroElektronika Clicker 2
clicker2.group=MikroElektronika
clicker2.platform=pic32
clicker2.build.board=_BOARD_CLICKER2_PIC32MX_
clicker2.build.extra_flags=-D_USE_USB_FOR_SERIAL_
clicker2.ccflags=-Map="map.map"
clicker2.ldscript=chipKIT-application-32MX460F512-uhb.ld

clicker2.usb.vid=1234
clicker2.usb.pid=0001
clicker2.usb.protocol=uhb

clicker2.compiler.c.extra_flags=
clicker2.compiler.cpp.extra_flags=
clicker2.upload.protocol=stk500v2

clicker2.upload.maximum_size=500000
clicker2.upload.speed=115200
clicker2.upload.tool=pic32prog-hid

clicker2.build.mcu=32MX460F512L
clicker2.build.f_cpu=80000000L
clicker2.build.core=pic32
clicker2.build.variant=Clicker2

############################################################
flipnclickmz.name=MikroElektronika Flip N Click MZ
flipnclickmz.group=MikroElektronika
flipnclickmz.platform=pic32
flipnclickmz.build.board=_BOARD_PIC32MZ_FLIP_N_CLICK_
flipnclickmz.ccflags=ffff
#flipnclickmz.ldscript=MZ-application-32MZ2048ECX.ld
flipnclickmz.ldcommon=chipKIT-application-COMMON-MZ.ld

flipnclickmz.compiler.c.extra_flags=
flipnclickmz.compiler.cpp.extra_flags=
flipnclickmz.upload.protocol=stk500v2

flipnclickmz.upload.maximum_size=2080768
flipnclickmz.upload.maximum_data_size=524288
flipnclickmz.upload.speed=115200
flipnclickmz.upload.tool=pic32prog

flipnclickmz.bootloader.low_fuses=0xff
flipnclickmz.bootloader.high_fuses=0xdd
flipnclickmz.bootloader.extended_fuses=0x00
#flipnclickmz.bootloader.path=not-supported
#flipnclickmz.bootloader.file=not-supported
flipnclickmz.bootloader.unlock_bits=0x3F
flipnclickmz.bootloader.lock_bits=0x0F

flipnclickmz.build.mcu=32MZ2048EFG100
flipnclickmz.build.f_cpu=200000000UL
flipnclickmz.build.core=pic32
flipnclickmz.build.variant=Flip_N_Click
flipnclickmz.build.ldscript.path={build.variant.path}
#mikroe_PIC32MZFlipNClick.upload.using=avrdude1


############################################################
curiositymx.name=Microchip Curiosity PIC32MX470
curiositymx.group=Microchip
curiositymx.platform=pic32
curiositymx.build.board=_BOARD_MICROCHIP_CURIOSITY_PIC32MX_
curiositymx.ccflags=ffff
curiositymx.ldscript=chipKIT-application-32MX470F512.ld

curiositymx.build.extra_flags=-D_USE_USB_FOR_SERIAL_

curiositymx.upload.protocol=stk500v2
curiositymx.upload.maximum_size=520192
curiositymx.upload.maximum_data_size=131072
curiositymx.upload.speed=115200
curiositymx.upload.tool=pic32prog

curiositymx.build.mcu=32MX470F512H
curiositymx.build.f_cpu=120000000L
curiositymx.build.core=pic32
curiositymx.build.variant=Curiosity_MX470
